#include <stdio.h>
#include <math.h>

#define PI4o3 (4 * M_PI / 3)
#define CUBE(n) ((n)* (n) * (n))

int main(void)
{ 
	double r;
	for (r = 1.0; r <= 10.0; r += 1.0) {
		printf("r = %f の球の体積: %f\n", r, PI4o3 * CUBE(r));
	}
	return 0;
}

/*
r = 1.000000 の球の体積: 4.188790
r = 2.000000 の球の体積: 33.510322
r = 3.000000 の球の体積: 113.097336
r = 4.000000 の球の体積: 268.082573
r = 5.000000 の球の体積: 523.598776
r = 6.000000 の球の体積: 904.778684
r = 7.000000 の球の体積: 1436.755040
r = 8.000000 の球の体積: 2144.660585
r = 9.000000 の球の体積: 3053.628059
r = 10.000000 の球の体積: 4188.790205
*/